BoxDomain/OSM/Eindhoven_51.44844_5.46475_dir100/100/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -2 0 0 0 0];
#include		"initialConditions";
internalField uniform $pressure;
        boundaryField
{
            frontAndBack
    {
                type slip;
            }
            building
    {
                type zeroGradient;
            }
            inlet
    {
                type zeroGradient;
            }
            outlet
    {
                type fixedValue;
                value uniform $pressure;
            }
            ground
    {
                type zeroGradient;
            }
ground_perim
    {
                type zeroGradient;
            }
        }

        // ************************************************************************* //
        